Repository: Peter74/merineo-product-badges
Catalog: languages/merineo-product-badges-*.po
Languages: cs_cz, sk_sk

source: Product Badges
cs_cz: Produktové štítky
sk_sk: Produktové badge

source: Settings
cs_cz: Nastavení
sk_sk: Nastavenia

source: Merineo Product Badges Settings
sk_sk: Nastavenia Merineo Product Badges

source: Layout & Placement
cs_cz: Rozložení a umístění
sk_sk: Rozloženie a umiestnenie

source: Design
sk_sk: Dizajn

source: Automatic Badges
cs_cz: Automatické štítky
sk_sk: Automatické badge

source: Custom CSS
sk_sk: Vlastné CSS

source: General settings
sk_sk: Všeobecné nastavenia

source: Enable product badges
cs_cz: Povolit produktové štítky
sk_sk: Zapnúť produktové badge

source: Turn the whole badge functionality on or off.
sk_sk: Zapne alebo vypne celé zobrazovanie produktových badge.

source: Single product placement
sk_sk: Umiestnenie na stránke produktu

source: Product archive placement
sk_sk: Umiestnenie vo výpise produktov

source: Custom placement
sk_sk: Vlastné umiestnenie

source: Custom hook
cs_cz: Vlastní hook
sk_sk: Vlastný hook

source: Hook priority
sk_sk: Priorita hooku

source: Alignment
cs_cz: Zarovnání
sk_sk: Zarovnanie

source: Left
cs_cz: Vlevo
sk_sk: Vľavo

source: Right
cs_cz: Vpravo
sk_sk: Vpravo

source: Layout
sk_sk: Rozloženie

source: Inline
cs_cz: V řádku
sk_sk: Vedľa seba

source: Stacked
cs_cz: Pod sebou
sk_sk: Pod sebou

source: Style variant
sk_sk: Štýl badge

source: Pill
sk_sk: Pill (kapsula)

source: Square
cs_cz: Čtverec
sk_sk: Hranatý

source: Rounded
sk_sk: Zaoblený

source: Circle
cs_cz: Kruh
sk_sk: Kruh

source: Vertical ribbon
cs_cz: Svislá stuha
sk_sk: Zvislá stuha

source: Corner ribbon
cs_cz: Rohová stuha
sk_sk: Rohová stuha

source: Outline style
cs_cz: Obrysový styl
sk_sk: Len obrys

source: Render badges with outline instead of solid fill.
sk_sk: Zobraziť badge len s obrysom namiesto plnej výplne.

source: Badge typography
sk_sk: Typografia badge

source: Font size (px)
cs_cz: Velikost písma (px)
sk_sk: Veľkosť písma (px)

source: Text transform
cs_cz: Transformace textu
sk_sk: Transformácia textu

source: Normal
cs_cz: Normální
sk_sk: Normálna

source: Uppercase
cs_cz: VELKÁ PÍSMENA
sk_sk: Veľké písmená

source: Font weight
cs_cz: Tloušťka písma
sk_sk: Hrúbka písma

source: Normal weight
sk_sk: Normálne

source: Bold
cs_cz: Tučné
sk_sk: Tučné

source: Letter spacing (px)
cs_cz: Mezera mezi písmeny (px)
sk_sk: Rozostup písmen (px)

source: Shadow
sk_sk: Tieň

source: Enable subtle shadow on badges
cs_cz: Povolit jemný stín štítků
sk_sk: Zapnúť jemný tieň pod badge

source: Badge preview
sk_sk: Náhľad badge

source: Automatic badge: New
sk_sk: Automatický badge: Novinka

source: Automatic badge: Featured
sk_sk: Automatický badge: Odporúčaný

source: Automatic badge: Sale
sk_sk: Automatický badge: Akcia

source: Automatic badge: Stock
sk_sk: Automatický badge: Sklad

source: Automatic badge: Bestseller
sk_sk: Automatický badge: Bestseller

source: Enabled
cs_cz: Povoleno
sk_sk: Zapnuté

source: Label
cs_cz: Text štítku
sk_sk: Text

source: Background color
cs_cz: Barva pozadí
sk_sk: Farba pozadia

source: Text color
cs_cz: Barva textu
sk_sk: Farba textu

source: Show as
sk_sk: Zobraziť ako

source: Hidden
sk_sk: Nezobrazovať

source: Text label
sk_sk: Len text

source: Percentage
sk_sk: Percento

source: Saved amount
sk_sk: Ušetrená suma

source: Days to show as new
sk_sk: Počet dní ako novinka

source: Number of days after publication when product is still considered new.
sk_sk: Počet dní od zverejnenia, počas ktorých sa produkt zobrazuje ako novinka.

source: Top bestseller count
sk_sk: Počet top bestsellerov

source: Number of top selling products that should receive the bestseller badge.
sk_sk: Počet najpredávanejších produktov, ktoré dostanú badge Bestseller.

source: Custom CSS for badges
sk_sk: Vlastné CSS pre badge

source: All custom CSS is automatically scoped under the badges wrapper to avoid breaking your theme.
sk_sk: Všetko vlastné CSS je automaticky obmedzené len na wrapper badge, aby nerozbilo vzhľad témy.

source: CSS helper
sk_sk: CSS pomocník

source: Click to copy selector
sk_sk: Kliknutím skopírujete selektor

source: Category badges
sk_sk: Badge kategórie

source: Configure badges that will be applied to all products in this category.
sk_sk: Nastavte badge, ktoré sa použijú pre všetky produkty v tejto kategórii.

source: Add badge
cs_cz: Přidat štítek
sk_sk: Pridať badge

source: Remove badge
sk_sk: Odstrániť badge

source: Product badges
sk_sk: Badge produktu

source: Configure badges specific to this product.
sk_sk: Nastavte badge, ktoré sú špecifické pre tento produkt.

source: No badges yet. Click the button below to add your first badge.
sk_sk: Zatiaľ nemáte žiadne badge. Kliknite na tlačidlo nižšie a pridajte prvý badge.

source: Custom badge
sk_sk: Vlastný badge

source: Badge text
sk_sk: Text badge

source: Badge background color
sk_sk: Farba pozadia badge

source: Badge text color
sk_sk: Farba textu badge

source: Settings saved.
sk_sk: Nastavenia boli uložené.

source: New
cs_cz: Novinka
sk_sk: Novinka

source: Featured
sk_sk: Odporúčaný

source: Sale
cs_cz: Sleva
sk_sk: Akcia

source: In stock
cs_cz: Skladem
sk_sk: Na sklade

source: Out of stock
cs_cz: Vyprodáno
sk_sk: Vypredané

source: On backorder
sk_sk: Na objednávku

source: Sale badge mode
sk_sk: Režim badge Akcia

source: Use WooCommerce price formatting for the saved amount.
sk_sk: Použiť formátovanie ceny z WooCommerce pre ušetrenú sumu.

source: Global settings for all badges.
sk_sk: Globálne nastavenia pre všetky badge.

source: Preview
sk_sk: Náhľad

source: Flexible WooCommerce product badges with global, category, and per-product configuration.
cs_cz: Flexibilní produktové štítky pro WooCommerce s globálním, kategoriovým a produktovým nastavením.

source: No badges yet. Click "Add badge" to create one.
cs_cz: Zatím nemáte žádné štítky. Klikněte na „Přidat štítek“ a vytvořte první.

source: Badge
cs_cz: Štítek

source: Text for badge
cs_cz: Text štítku

source: Background
cs_cz: Pozadí

source: Merineo Badges
cs_cz: Merineo štítky

source: Badges configured here will be applied to all products assigned to this category.
cs_cz: Štítky nastavené zde se použijí na všechny produkty přiřazené do této kategorie.

source: Badges configured here will be applied to all products assigned to this category. Products also inherit global and product-specific badges.
cs_cz: Štítky nastavené zde se použijí na všechny produkty přiřazené do této kategorie. Produkty také dědí globální a produktové štítky.

source: You do not have permission to access this page.
cs_cz: Nemáte dostatečná oprávnění pro zobrazení této stránky.

source: Custom badges for this product. Product also inherits global and category badges.
cs_cz: Vlastní štítky pro tento produkt. Produkt také dědí globální a kategoriové štítky.

source: Copied
cs_cz: Zkopírováno

source: Design & Typography
cs_cz: Design a typografie

source: Advanced & Custom CSS
cs_cz: Pokročilé & vlastní CSS

source: Global toggle
cs_cz: Globální přepínač

source: Turn the entire product badges feature on or off.
cs_cz: Zapněte nebo vypněte celou funkcionalitu produktových štítků.

source: Placement
cs_cz: Umístění

source: Choose where badges should appear in single product view, product archives and custom locations.
cs_cz: Vyberte, kde se mají štítky zobrazovat na stránce produktu, v archivech produktů a na vlastních umístěních.

source: Single product page
cs_cz: Stránka detailu produktu

source: Product archive / category
cs_cz: Archiv produktů / kategorie

source: Automatic badges
cs_cz: Automatické štítky

source: Configure rules-based badges like New, Recommended, Sale, stock statuses and Bestsellers.
cs_cz: Nastavte pravidlové štítky jako Novinka, Doporučené, Sleva, stavy skladu a Nejprodávanější.

source: Recommended
cs_cz: Doporučené

source: Backorder
cs_cz: Na objednávku

source: Bestseller
cs_cz: Nejprodávanější

source: Badges are rendered in this order (when active): Recommended, Sale, Multipack, New, Category, Product-specific.
cs_cz: Štítky se vykreslují v tomto pořadí (pokud jsou aktivní): Doporučené, Sleva, Multipack, Novinka, Kategorie, Produktové.

source: Typography
cs_cz: Typografie

source: Badge style & layout
cs_cz: Styl a rozložení štítků

source: Choose overall shape for badges, outline vs solid, and whether badges are displayed inline or stacked.
cs_cz: Vyberte celkový tvar štítků, obrys vs. plná výplň a zda se mají zobrazovat v řádku nebo pod sebou.

source: Compact pill
cs_cz: Kompaktní ovál

source: Rounded rectangle
cs_cz: Zaoblený obdélník

source: Tag
cs_cz: Štítek

source: Badge layout
cs_cz: Rozložení štítků

source: Custom CSS (scoped)
cs_cz: Vlastní CSS (scope)

source: CSS is scoped under the .merineo-badges-scope wrapper to minimize the risk of breaking your theme.
cs_cz: CSS je omezené na wrapper .merineo-badges-scope, aby se minimalizovalo riziko narušení vaší šablony.

source: Useful selectors
cs_cz: Užitečné selektory

source: Custom hook only
cs_cz: Pouze vlastní hook

source: Custom hook name
cs_cz: Název vlastního hooku

source: Priority
cs_cz: Priorita

source: Single product hooks control badges on the product detail page.
cs_cz: Hooky pro single produkt ovládají štítky na stránce detailu produktu.

source: Loop hooks control badges on shop, category and archive listings.
cs_cz: Hooky pro loop ovládají štítky na stránkách obchodu, kategorií a archivů.

source: Use custom hooks for advanced placements in your theme or custom templates.
cs_cz: Použijte vlastní hooky pro pokročilá umístění ve vaší šabloně nebo vlastních šablonách.

source: Toggle badge settings
cs_cz: Rozbalit/schovat nastavení štítku

source: You can use {max_discount} in the label to insert the maximum multipack discount (e.g. "-20%" or "10 €").
cs_cz: V textu štítku můžete použít {max_discount} pro vložení maximální multipack slevy (např. „-20 %“ nebo „10 €“).

source: Minimum discount to show badge (%)
cs_cz: Minimální sleva pro zobrazení štítku (%)

source: Badge is only shown if the effective maximum multipack discount (in percent) is greater or equal to this value.
cs_cz: Štítek se zobrazí pouze tehdy, pokud je efektivní maximální multipack sleva (v procentech) větší nebo rovna této hodnotě.

source: Days visible after product creation
cs_cz: Počet dní po vytvoření produktu, během kterých se má zobrazovat

source: Sale display mode
cs_cz: Režim zobrazení slevy

source: Do not display
cs_cz: Nezobrazovat

source: Label only
cs_cz: Pouze text

source: Discount percent (e.g. -15 %)
cs_cz: Procento slevy (např. -15 %)

source: Saved amount (e.g. -5€)
cs_cz: Ušetřená částka (např. -5 €)

source: Top bestseller products
cs_cz: Počet nejprodávanějších produktů
